In [2]:
import pandas as pd

In [3]:
"""
What is in pandas?
1. Series
2. Data Frames
3. Missing Data
4. Group By
5. Merging, Joining, Concatenating
6. Operations
7. Data Input and Output
"""

'\nWhat is in pandas?\n1. Series\n2. Data Frames\n3. Missing Data\n4. Group By\n5. Merging, Joining, Concatenating\n6. Operations\n7. Data Input and Output\n'

In [5]:
# Series: Data type in pandas

In [6]:
import numpy as np

In [7]:
# crrating various series

In [13]:
labels = ['a', 'b', 'c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a': 10, 'b': 20, 'c': 30}

In [14]:
my_data

[10, 20, 30]

In [15]:
arr

array([10, 20, 30])

In [16]:
d

{'a': 10, 'b': 20, 'c': 30}

In [18]:
# create series, with index values
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [21]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [22]:
# more ways to create series
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [23]:
# In case of dictionary it automatically get keys
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [24]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [26]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [27]:
pd.Series(data=[sum, print, len, max])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
3      <built-in function max>
dtype: object

In [28]:
# using series is understanding index

In [32]:
ser1 = pd.Series([1,2,3,4], ['USA', 'GERMANY', 'uk', 'CANADA'])

In [33]:
ser1

USA        1
GERMANY    2
uk         3
CANADA     4
dtype: int64

In [34]:
ser1[1]

2

In [35]:
ser1['USA']

1

In [37]:
ser1

USA        1
GERMANY    2
uk         3
CANADA     4
dtype: int64

In [38]:
# Data frames

In [39]:
from numpy.random import randn

In [40]:
np.random.seed(101)

In [41]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z'])

In [42]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
# In above each column is series

In [44]:
# its a series
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [45]:
type(df['W'])

pandas.core.series.Series

In [46]:
type(df)

pandas.core.frame.DataFrame

In [47]:
df['X']

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [48]:
# create a data frame of two columns
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [49]:
df['new'] = df['W'] + df['Y']

In [51]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [53]:
# original is not change
df.drop('new', axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [55]:
# to change original, use inplace  arguments

In [56]:
df.drop('new', axis=1, inplace=True)

In [57]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [60]:
# rows at  axis 0
# columns at axis 1
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [61]:
# get shape of data frame
df.shape

(5, 4)

In [62]:
df[['Z','X']]

          Z         X
A  0.503826  0.628133
B  0.605965 -0.319318
C -0.589001  0.740122
D  0.955057 -0.758872
E  0.683509  1.978757

In [63]:
# ROWS

In [64]:
# return data of row A
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [69]:
# get row using index position using iloc, pass index value

In [70]:
df.iloc[1]

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [71]:
# selecting subset of rows and columns

In [72]:
# It return single value
df.loc['A','W']

2.706849839399938

In [73]:
df.loc[['A','B'], ['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [74]:
# Data frames part 2

In [75]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [76]:
# conditional selection

In [78]:
# return boolean value
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [79]:
df > 11

       W      X      Y      Z
A  False  False  False  False
B  False  False  False  False
C  False  False  False  False
D  False  False  False  False
E  False  False  False  False

In [83]:
booldf = df > 0

In [84]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [86]:
# return false value as a NaN
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [87]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [88]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [89]:
# return series or column
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [90]:
# return only greater rows
# conditional selection
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [91]:
# rerturn row
df[df['Z'] < 0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [92]:
result = df[df['W']>0]
result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [93]:
result['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [95]:
# get in one step
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [98]:
df[df['X']>0][['X', 'Y']]

          X         Y
A  0.628133  0.907969
C  0.740122  0.528813
E  1.978757  2.605967

In [100]:
# In multiple lines
bool_series = df['W'] > 0
result = df[bool_series]
my_cols = ['Y','X']
result[my_cols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [101]:
# using multiple conditions

In [103]:
df[(df['W']>0) & (df['Y']> 1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [104]:
df[(df['W']>0) | (df['Y']> 1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [105]:
# for and and or use & and | as a operator

In [106]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [107]:
# get index from  as new columns for rows
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [108]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [109]:
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [110]:
# it adds new column
df['states'] = newind

In [111]:
df

          W         X         Y         Z states
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [113]:
# states  index set as a new index
df.set_index('states')

               W         X         Y         Z
states
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [114]:
df

          W         X         Y         Z states
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [115]:
# Data frame part 3:

In [116]:
# multi index and index hierarchy

In [117]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
# convert list of tuple pairs
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [118]:
# It ceates the levels 
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [121]:
df = pd.DataFrame(randn(6,2), hier_index, ['A', 'B'])

In [122]:
df

             A         B
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [123]:
# g1 index
df.loc['G1']

          A         B
1 -0.497104 -0.754070
2 -0.943406  0.484752
3 -0.116773  1.901755

In [124]:
df.loc['G1'].loc[1]

A   -0.497104
B   -0.754070
Name: 1, dtype: float64

In [125]:
df

             A         B
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [128]:
# name index
df.index.names = ['Groups', 'Num']

In [129]:
df

                   A         B
Groups Num
G1     1   -0.497104 -0.754070
       2   -0.943406  0.484752
       3   -0.116773  1.901755
G2     1    0.238127  1.996652
       2   -0.993263  0.196800
       3   -1.136645  0.000366

In [135]:
df.loc['G2'].loc[2][1]

0.19679950499134005

In [141]:
# cross section
df.xs(1, level='Num')

               A         B
Groups
G1     -0.497104 -0.754070
G2      0.238127  1.996652

In [142]:
# Missing Data

In [143]:
# Drop missing values and fill

In [144]:
d = {'A':[1,2,np.nan], 'B':[4, np.nan, np.nan], 'C':[np.nan, 3,4]}

In [145]:
df = pd.DataFrame(d)

In [146]:
df

     A    B    C
0  1.0  4.0  NaN
1  2.0  NaN  3.0
2  NaN  NaN  4.0

In [147]:
# drop whole row if it has any nan value
df.dropna()

Empty DataFrame
Columns: [A, B, C]
Index: []

In [148]:
df

     A    B    C
0  1.0  4.0  NaN
1  2.0  NaN  3.0
2  NaN  NaN  4.0

In [149]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [150]:
df

     A    B    C
0  1.0  4.0  NaN
1  2.0  NaN  3.0
2  NaN  NaN  4.0

In [151]:
# Fill Nan

In [153]:
# it fill 10 in every nan
df.fillna(value=10)

      A     B     C
0   1.0   4.0  10.0
1   2.0  10.0   3.0
2  10.0  10.0   4.0

In [155]:
# fill mean
df

     A    B    C
0  1.0  4.0  NaN
1  2.0  NaN  3.0
2  NaN  NaN  4.0

In [156]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [157]:
df.fillna(value=df.mean())

     A    B    C
0  1.0  4.0  3.5
1  2.0  4.0  3.0
2  1.5  4.0  4.0

In [159]:
# Group By: data group together and call aggregate function

In [160]:
# Group by allows you to group together rows based on a
# column and perform an aggregate function on them

In [162]:
data = {'company': ["GOOG", "GOOG", "MFA", "MFA", "HEE", "HEE"],
       'Person': ["sam", "jack", "john", "mona", "carl", "som"],
       'Sales': [100,200,300,500,600,200]}

In [163]:
data

{'company': ['GOOG', 'GOOG', 'MFA', 'MFA', 'HEE', 'HEE'],
 'Person': ['sam', 'jack', 'john', 'mona', 'carl', 'som'],
 'Sales': [100, 200, 300, 500, 600, 200]}

In [164]:
df = pd.DataFrame(data)

In [165]:
df

  company Person  Sales
0    GOOG    sam    100
1    GOOG   jack    200
2     MFA   john    300
3     MFA   mona    500
4     HEE   carl    600
5     HEE    som    200

In [168]:
# group by the company
by_comp = df.groupby('company')

In [169]:
by_comp

In [171]:
by_comp.median()

         Sales
company
GOOG       150
HEE        400
MFA        400

In [172]:
by_comp.mean()

         Sales
company
GOOG       150
HEE        400
MFA        400

In [173]:
by_comp.std()

              Sales
company
GOOG      70.710678
HEE      282.842712
MFA      141.421356

In [174]:
by_comp.sum()

         Sales
company
GOOG       300
HEE        800
MFA        800

In [175]:
by_comp.max()

        Person  Sales
company
GOOG       sam    200
HEE        som    600
MFA       mona    500

In [176]:
by_comp.min()

        Person  Sales
company
GOOG      jack    100
HEE       carl    200
MFA       john    300

In [178]:
df.groupby('company').count()

         Person  Sales
company
GOOG          2      2
HEE           2      2
MFA           2      2

In [179]:
# give bunch of information
df.groupby('company').describe()

        Sales
        count   mean         std    min    25%    50%    75%    max
company
GOOG      2.0  150.0   70.710678  100.0  125.0  150.0  175.0  200.0
HEE       2.0  400.0  282.842712  200.0  300.0  400.0  500.0  600.0
MFA       2.0  400.0  141.421356  300.0  350.0  400.0  450.0  500.0

In [180]:
# give bunch of information
df.groupby('company').describe().transpose()

company            GOOG         HEE         MFA
Sales count    2.000000    2.000000    2.000000
      mean   150.000000  400.000000  400.000000
      std     70.710678  282.842712  141.421356
      min    100.000000  200.000000  300.000000
      25%    125.000000  300.000000  350.000000
      50%    150.000000  400.000000  400.000000
      75%    175.000000  500.000000  450.000000
      max    200.000000  600.000000  500.000000

In [181]:
# Merging. joining, concatenating

In [182]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [183]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [184]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [185]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [186]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [187]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [188]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [189]:
pd.concat([df1, df2, df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [190]:
# In above we have much of missing values
df.mean()

Sales    316.666667
dtype: float64

In [209]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [210]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [211]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [213]:
pd.merge(left, right, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [214]:
"""
Merging

The merge function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. For example:

"""

'\nMerging\n\nThe merge function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. For example:\n\n'

In [215]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [216]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [217]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [218]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [219]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [220]:
# join

In [221]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [222]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [223]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [224]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [225]:
right.join(left)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

In [226]:
# Operations

In [227]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [228]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [229]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [230]:
# give array of unique values
df['col2'].unique()

array([444, 555, 666])

In [231]:
# get number of unique values

In [232]:
df['col2'].nunique()

3

In [233]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [234]:
# selecting data

In [235]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [236]:
df[df['col2']>2]

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [237]:
df[(df['col2']>2) & (df['col2']==444)]

   col1  col2 col3
0     1   444  abc
3     4   444  xyz

In [238]:
df['col2']> 2

0    True
1    True
2    True
3    True
Name: col2, dtype: bool

In [239]:
# Apply methods

In [240]:
def times(x):
    return x*2

In [241]:
df['col1'].sum()

10

In [242]:
# custom function

In [244]:
df['col1'].apply(times)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [245]:
# length of string
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [247]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [248]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [249]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [250]:
# sorting and ordering

In [251]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [255]:
df.sort_values('col2', ascending=False)

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz

In [256]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [257]:
# pivot table

In [258]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [259]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [262]:
df.pivot_table(values='D', index=['A'], columns=['C'])

C      x    y
A
bar  4.0  3.0
foo  1.5  3.0